In [1]:
import pandas as pd
import numpy as np

In [2]:
# Criação de data frame apartir de um array

In [4]:
arr = np.random.randint(10, 55, size=(4,4))

In [5]:
arr

array([[31, 42, 26, 16],
       [23, 30, 32, 21],
       [16, 13, 38, 20],
       [28, 49, 38, 27]])

In [10]:
df1 = pd.DataFrame(data=arr, index=['A', 'B', 'C', 'D'], columns=['tipo1', 'tipo2', 'tipo3', 'tipo4'])

In [11]:
df1

   tipo1  tipo2  tipo3  tipo4
A     31     42     26     16
B     23     30     32     21
C     16     13     38     20
D     28     49     38     27

In [14]:
# Criação de dataframe apartir de dicionarios

In [15]:
dados = {'produtos':['ps4','pc','teclado','mouse','microfe'],'preço':[2600,2450,99.90,75,129.90]}

In [16]:
df2 = pd.DataFrame(data=dados)

In [17]:
df2

  produtos   preço
0      ps4  2600.0
1       pc  2450.0
2  teclado    99.9
3    mouse    75.0
4  microfe   129.9

In [18]:
# Criando nova coluna

In [21]:
df2['custo'] = [1900, 2000, 40, 56.50, 95.4]

In [22]:
df2

  produtos   preço   custo
0      ps4  2600.0  1900.0
1       pc  2450.0  2000.0
2  teclado    99.9    40.0
3    mouse    75.0    56.5
4  microfe   129.9    95.4

In [23]:
df2['lucro'] = df2['preço'] - df2['custo']

In [24]:
df2

  produtos   preço   custo  lucro
0      ps4  2600.0  1900.0  700.0
1       pc  2450.0  2000.0  450.0
2  teclado    99.9    40.0   59.9
3    mouse    75.0    56.5   18.5
4  microfe   129.9    95.4   34.5